# data.py

regions = [
    "서울", "인천", "수원", "춘천", "청주", "강릉", "전주", "대전", "안동",
    "울릉/독도", "포항", "울산", "부산", "대구", "목포", "광주", "여수", "제주"
]

region_activities = {
    "서울": ["남산타워", "홍대 거리", "경복궁"],
    "인천": ["차이나타운", "화풍난양", "월미도"],
    "수원": ["수원화성", "광교호수공원", "행리단길"],
    "춘천": ["닭갈비 골목", "해피초원목장", "레고랜드"],
    "청주": ["상당산성", "청남대", "국립현대미술관"],
    "강릉": ["오죽헌", "강릉중앙시장", "안목해변카페거리"],
    "전주": ["한옥마을", "청년몰", "객리단길"],
    "대전": ["성심당", "대전 엑스포", "대전오월드플라워랜드"],
    "울릉/독도": ["독도", "천부해중전망대", "나리분지"],
    "안동": ["하회마을", "도산서원", "만휴정"],
    "포항": ["영일대 해수욕장", "철길숲", "스페이스워크"],
    "울산": ["선암호수공원", "장생포고래박물관", "자수정동굴나라"],
    "부산": ["해운대", "부산엑스더스카이", "감천 문화마을"],
    "대구": ["사유원", "팔공산국립공원", "서문시장"],
    "목포": ["근대역사문화공간", "해상케이블카", "유달산"],
    "광주": ["국립아시아문화전당", "무등산 국립공원", "광주패밀리랜드드"],
    "여수": ["엑스포해양공원", "디오션 워터파크", "유월드 루지 테마파크"],
    "제주": ["스누피가든", "성산일출봉", "한라산국립공원"],
}
